"use client";
import { useForm } from "react-hook-form";
import { useEffect, useState } from "react";
import Image from "next/image";
import PostFuntion from "@/lib/PostFuntion";
import { CreateFormData } from "@/lib/CreateFormData";

export default function NewsForm({ defaultValues }) {

  const {
    register,
    handleSubmit,
    watch,
    reset,
    formState: { errors },
  } = useForm({
      defaultValues:{
      _id:defaultValues?._id || null, 
      reporter: defaultValues?.reporter || "",
      title:defaultValues?.title || "",
      description: defaultValues?.description ||"",
      category: defaultValues?.category ||"",
      subcategory: defaultValues?.subcategory ||"",
      locationType:defaultValues?.locationType || "bangladesh",
      country: defaultValues?.country ||"",
      division: defaultValues?.division ||"",
      district:defaultValues?.district || "",
      upazila:defaultValues?.upazila || "",
      image:defaultValues?.imageUrl || null,
      imageBy:defaultValues?.imageBy || "",
      status:defaultValues?.status || "draft",
      breaking:defaultValues?.breaking==="true"  || false,
    },
  });


  useEffect(()=>{
    if(defaultValues){

      console.log("d",defaultValues);
      
       reset({
      _id:defaultValues?._id || null, 
      reporter: defaultValues?.reporter || "",
      title:defaultValues?.title || "",
      description: defaultValues?.description ||"",
      category: defaultValues?.category ||"",
      subcategory: defaultValues?.subcategory ||"",
      locationType:defaultValues?.locationType || "bangladesh",
      country: defaultValues?.country ||"",
      division: defaultValues?.division ||"all",
      district:defaultValues?.district || "all",
      upazila:defaultValues?.upazila || "all",
      image:defaultValues?.imageUrl || null,
      imageBy:defaultValues?.imageBy || "",
      status:defaultValues?.status || "draft",
      breaking:defaultValues?.breaking==='true' || false,
      })
    }
  },[defaultValues])

  // -------------------------
  // ডাইনামিক ডাটা (ডেমো)
  // -------------------------
    const WorldList=[
    "মধ্যপ্রাচ্য",
    "যুক্তরাষ্ট্র",
    "ইউরোপ",
    "এশিয়া",
    "ভারত",
    "যুক্তরাজ্য",
    "পাকিস্তান",
    "মালয়েশিয়া",
    "উত্তর আমেরিকা",
    "দক্ষিণ আমেরিকা",
    "আফ্রিকা",
    "অন্যান্য"
    ];
    const categories = {
      "আজকের পত্রিকা":["প্রথম পাতা","খবর","যত মত তত পথ","বিশ্ববেলা","খেলা","শেষপাতা","বাণিজ্যবেলা","তারাবেলা",],
      রাজনীতি: [],
      খেলা: ["ক্রিকেট","ফুটবল","অন্যান্য"],
      বিনোদন: ["বলিউড","ঢালিউড","টালিউড","হলিউড","ওটিটি","নাটক","গান","অন্যান্য"],
      বাণিজ্য:[],
      শিক্ষা:["ক্যাম্পাস","ভর্তি","পরীক্ষা","ফলাফল","অন্যান্য"],
      নির্বাচন:[],
      মতামত:["সাক্ষাৎকার","সম্পাদকীয়","উপ-সম্পাদকীয়","প্রতিক্রিয়া","তর্ক-বিতর্ক","স্মরণ","চিঠি","বই পর্যালোচনা","পাঠকের কথা","অন্যান্য"],
      লাইফস্টাইল:["ফ্যাশন","রূপচর্চা","গৃহসজ্জা","ক্র্যাফট","জুয়েলারি","খাবার","অন্যান্য"],
      আইন_আদালত:[],
      অপরাধ:[],
      স্বাস্থ্য:["স্বাস্থ্য সেবা","স্বাস্থ্য শিক্ষা","বিশ্ব স্বাস্থ্য","চিকিৎসা","রোগ","স্বাস্থ্য জিজ্ঞাসা","অন্যান্য"],
      ধর্ম:[],
      শিল্প_সাহিত্য:["কবিতা","সাহিত্য","অন্যান্য"],
      প্রবাস:[],
      প্রযুক্তি:["গ্যাজেট","মোবাইল","অ্যাপস","টেলিকম","কম্পিউটার","বিজ্ঞান","টিপস","রিভিউ","ফ্রিলান্সিং","অন্যান্য"],
      চাকরি:[],
      নারী_শিশু:[],
      আইন_পরামর্শ:[],
      সোশ্যাল_মিডিয়া:[],
      বিচিত্র:[],
      কর্পোরেট:[],
      পরিবেশ_জলবায়ু:[],
      পিএসআই:[],
      রম্যবেলা:[],

    };


    const DivisionList = {

      "ঢাকা": {
        "ঢাকা": ["ধামরাই","দোহার","কেরানীগঞ্জ","নবাবগঞ্জ","সাভার","ঢাকা উত্তর","ঢাকা দক্ষিণ"],
        "ফরিদপুর": ["আলফাডাঙ্গা","ভাঙ্গা","বোয়ালমারী","চরভদ্রাসন","ফরিদপুর সদর","মধুখালী","নগরকান্দা","সদরপুর","সলথা"],
        "গাজীপুর": ["গাজীপুর সদর","কালিয়াকৈর","কালীগঞ্জ","কাপাসিয়া","শ্রীপুর"],
        "গোপালগঞ্জ": ["গোপালগঞ্জ সদর","কাশিয়ানী","কোটালীপাড়া","মুকসুদপুর","টুঙ্গিপাড়া"],
        "কিশোরগঞ্জ": ["বাজিতপুর","ভৈরব","হোসেনপুর","ইটনা","করিমগঞ্জ","কটিয়াদী","কিশোরগঞ্জ সদর","কুলিয়ারচর","মিঠামইন","নিকলী","পাকুন্দিয়া","তাড়াইল"],
        "মাদারীপুর": ["ডাসার","কালকিনি","মাদারীপুর সদর","রাজৈর","শিবচর"],
        "মানিকগঞ্জ": ["দৌলতপুর","ঘিওর","হরিরামপুর","মানিকগঞ্জ সদর","সাটুরিয়া","শিবালয়","সিঙ্গাইর"],
        "মুন্সিগঞ্জ": ["গজারিয়া","লৌহজং","মুন্সিগঞ্জ সদর","সিরাজদিখান","শ্রীনগর","টঙ্গিবাড়ী"],
        "নারায়ণগঞ্জ": ["আড়াইহাজার","বন্দর","নারায়ণগঞ্জ সদর","রূপগঞ্জ","সোনারগাঁ"],
        "নরসিংদী": ["বেলাবো","মনোহরদী","নরসিংদী সদর","পলাশ","রায়পুরা","শিবপুর"],
        "রাজবাড়ী": ["বালিয়াকান্দি","গোয়ালন্দ","পাংশা","রাজবাড়ী সদর","কালুখালী"],
        "শরীয়তপুর": ["ভেদরগঞ্জ","ডামুড্যা","গোসাইরহাট","জাজিরা","নড়িয়া","শরীয়তপুর সদর"],
        "টাঙ্গাইল": ["টাঙ্গাইল সদর","বাসাইল","ভুয়াপুর","দেলদুয়ার","ধানবাড়ী","ঘাটাইল","গোপালপুর","কালিহাতী","মধুপুর","মির্জাপুর","নাগরপুর","সখীপুর"]
      },

      "চট্টগ্রাম": {
        "চট্টগ্রাম": ["আনোয়ারা","বাঁশখালী","বোয়ালখালী","চন্দনাইশ","ফটিকছড়ি","হাটহাজারী","কর্ণফুলী","মিরসরাই","পটিয়া","রাঙ্গুনিয়া","রাউজান","সন্দ্বীপ","সীতাকুণ্ড","লোহাগাড়া","সাতকানিয়া"],
        "কক্সবাজার": ["কক্সবাজার সদর","চকরিয়া","কুতুবদিয়া","মহেশখালী","রামু","টেকনাফ","উখিয়া","পেকুয়া","ঈদগাঁও"],
        "বান্দরবান": ["বান্দরবান সদর","আলীকদম","লামা","নাইক্ষ্যংছড়ি","রোয়াংছড়ি","রুমা","থানচি"],
        "ব্রাহ্মণবাড়িয়া": ["ব্রাহ্মণবাড়িয়া সদর","কসবা","আখাউড়া","আশুগঞ্জ","বাঞ্ছারামপুর","বিজয়নগর","নাসিরনগর","নবীনগর","সরাইল"],
        "চাঁদপুর": ["চাঁদপুর সদর","হাজীগঞ্জ","ফরিদগঞ্জ","মতলব দক্ষিণ","মতলব উত্তর","কচুয়া","শাহরাস্তি","হাইমচর"],
        "কুমিল্লা": ["কুমিল্লা সদর","বরুড়া","চান্দিনা","দাউদকান্দি","দেবিদ্বার","লাকসাম","মুরাদনগর","নাঙ্গলকোট","তিতাস","চৌদ্দগ্রাম","হোমনা","মেঘনা","মনোহরগঞ্জ","সদর দক্ষিণ"],
        "ফেনী": ["ফেনী সদর","ফুলগাজী","পরশুরাম","দাগনভূঞা","ছাগলনাইয়া"],
        "খাগড়াছড়ি": ["খাগড়াছড়ি সদর","দীঘিনালা","পানছড়ি","লক্ষ্মীছড়ি","মহালছড়ি","মানিকছড়ি","রামগড়","মাটিরাঙ্গা"],
        "লক্ষ্মীপুর": ["লক্ষ্মীপুর সদর","রামগঞ্জ","রায়পুর","কমলনগর","রামগতি"],
        "নোয়াখালী": ["নোয়াখালী সদর","বেগমগঞ্জ","চাটখিল","কোম্পানীগঞ্জ","হাতিয়া","সুবর্ণচর","সেনবাগ"],
        "রাঙ্গামাটি": ["রাঙ্গামাটি সদর","বরকল","বিলাইছড়ি","কাপ্তাই","কাউখালী","নানিয়ারচর","রাজস্থলী","বাঘাইছড়ি","জুরাছড়ি","লংগদু"]
      },

      "রাজশাহী": {
        "রাজশাহী": ["রাজশাহী সদর","পবা","বাগমারা","চারঘাট","দুর্গাপুর","গোদাগাড়ী","মোহনপুর","পুঠিয়া","তানোর"],
        "বগুড়া": ["বগুড়া সদর","আদমদিঘী","ধুনট","গাবতলী","কাহালু","নন্দীগ্রাম","সারিয়াকান্দি","শাজাহানপুর","শেরপুর","শিবগঞ্জ","সোনাতলা"],
        "নাটোর": ["নাটোর সদর","বাগাতিপাড়া","বড়াইগ্রাম","গুরুদাসপুর","লালপুর","সিংড়া"],
        "চাঁপাইনবাবগঞ্জ": ["চাঁপাইনবাবগঞ্জ সদর","ভোলাহাট","গোমস্তাপুর","নাচোল","শিবগঞ্জ"],
        "নওগাঁ": ["নওগাঁ সদর","আত্রাই","বদলগাছী","ধামইরহাট","মান্দা","মহাদেবপুর","নিয়ামতপুর","পত্নীতলা","পোরশা","রাণীনগর","সাপাহার"],
        "পাবনা": ["পাবনা সদর","আটঘরিয়া","বেড়া","ভাঙ্গুড়া","চাটমোহর","ফরিদপুর","ঈশ্বরদী","সাঁথিয়া","সুজানগর"],
        "সিরাজগঞ্জ": ["সিরাজগঞ্জ সদর","বেলকুচি","চৌহালি","কামারখন্দ","কাজীপুর","রায়গঞ্জ","শাহজাদপুর","তারাশ","উল্লাপাড়া"]
      },

      "খুলনা": {
        "খুলনা": ["খুলনা সদর","বটিয়াঘাটা","ডুমুরিয়া","দাকোপ","দিঘলিয়া","কয়রা","পাইকগাছা","ফুলতলা","রূপসা","তেরখাদা"],
        "বাগেরহাট": ["বাগেরহাট সদর","চিতলমারী","ফকিরহাট","কচুয়া","মোল্লাহাট","মোংলা","মোরেলগঞ্জ","রামপাল","শরণখোলা"],
        "সাতক্ষীরা": ["সাতক্ষীরা সদর","আশাশুনি","কালিগঞ্জ","কলারোয়া","শ্যামনগর","তালা"],
        "যশোর": ["যশোর সদর","অভয়নগর","বাঘারপাড়া","চৌগাছা","ঝিকরগাছা","কেশবপুর","মনিরামপুর","শার্শা"],
        "ঝিনাইদহ": ["ঝিনাইদহ সদর","হরিণাকুন্ডু","কালীগঞ্জ","কোটচাঁদপুর","মহেশপুর","শৈলকুপা"],
        "কুষ্টিয়া": ["কুষ্টিয়া সদর","ভেড়ামারা","দৌলতপুর","খোকসা","কুমারখালী","মিরপুর"],
        "মাগুরা": ["মাগুরা সদর","মহম্মদপুর","শালিখা","শ্রীপুর"],
        "মেহেরপুর": ["মেহেরপুর সদর","গাংনী","মুজিবনগর"],
        "নড়াইল": ["নড়াইল সদর","কালিয়া","লোহাগড়া"]
      },

      "বরিশাল": {
        "বরিশাল": ["বরিশাল সদর","আগৈলঝাড়া","বাবুগঞ্জ","বাকেরগঞ্জ","বানারীপাড়া","গৌরনদী","হিজলা","মেহেন্দিগঞ্জ","মুলাদী","উজিরপুর"],
        "ভোলা": ["ভোলা সদর","বোরহানউদ্দিন","চরফ্যাশন","দৌলতখান","লালমোহন","মনপুরা","তজুমুদ্দিন"],
        "পটুয়াখালী": ["পটুয়াখালী সদর","বাউফল","দশমিনা","দুমকি","গলাচিপা","কলাপাড়া","মির্জাগঞ্জ","রাঙ্গাবালী"],
        "পিরোজপুর": ["পিরোজপুর সদর","ভান্ডারিয়া","কাউখালী","মঠবাড়িয়া","নাজিরপুর","নেছারাবাদ","জিয়ানগর"],
        "ঝালকাঠি": ["ঝালকাঠি সদর","কাঁঠালিয়া","নলছিটি","রাজাপুর"],
        "বরগুনা": ["বরগুনা সদর","আমতলী","বামনা","বেতাগী","পাথরঘাটা","তালতলী"]
      },

      "সিলেট": {
        "সিলেট": ["সিলেট সদর","বালাগঞ্জ","বিয়ানীবাজার","বিশ্বনাথ","কোম্পানীগঞ্জ","ফেঞ্চুগঞ্জ","গোলাপগঞ্জ","গোয়াইনঘাট","জৈন্তাপুর","কানাইঘাট","ওসমানীনগর","জকিগঞ্জ","দক্ষিণ সুরমা"],
        "মৌলভীবাজার": ["মৌলভীবাজার সদর","বড়লেখা","জুড়ী","কমলগঞ্জ","কুলাউড়া","রাজনগর","শ্রীমঙ্গল"],
        "হবিগঞ্জ": ["হবিগঞ্জ সদর","বাহুবল","বানিয়াচং","চুনারুঘাট","লাখাই","মাধবপুর","নবীগঞ্জ","আজমিরীগঞ্জ"],
        "সুনামগঞ্জ": ["সুনামগঞ্জ সদর","দিরাই","দোয়ারাবাজার","জগন্নাথপুর","তাহিরপুর","দক্ষিণ সুনামগঞ্জ","বিশ্বম্ভরপুর","ছাতক","জামালগঞ্জ","শাল্লা","ধর্মপাশা","মধ্যনগর"]
      },

      "রংপুর": {
        "রংপুর": ["রংপুর সদর","বদরগঞ্জ","গঙ্গাচড়া","কাউনিয়া","মিঠাপুকুর","পীরগঞ্জ","পীরগাছা","তারাগঞ্জ"],
        "দিনাজপুর": ["দিনাজপুর সদর","বিরল","বিরগঞ্জ","বোচাগঞ্জ","চিরিরবন্দর","ফুলবাড়ী","ঘোড়াঘাট","হাকিমপুর","কাহারোল","খানসামা","নবাবগঞ্জ","পার্বতীপুর"],
        "গাইবান্ধা": ["গাইবান্ধা সদর","ফুলছড়ি","গোবিন্দগঞ্জ","পলাশবাড়ী","সাদুল্লাপুর","সাঘাটা","সুন্দরগঞ্জ"],
        "কুড়িগ্রাম": ["কুড়িগ্রাম সদর","ভূরুঙ্গামারী","চর রাজিবপুর","চিলমারী","ফুলবাড়ী","নাগেশ্বরী","রাজারহাট","রৌমারী","উলিপুর"],
        "লালমনিরহাট": ["লালমনিরহাট সদর","আদিতমারী","হাতীবান্ধা","কালীগঞ্জ","পাটগ্রাম"],
        "নীলফামারী": ["নীলফামারী সদর","ডোমার","ডিমলা","জলঢাকা","কিশোরগঞ্জ","সৈয়দপুর"],
        "পঞ্চগড়": ["পঞ্চগড় সদর","আটোয়ারী","বোড়া","দেবীগঞ্জ","তেঁতুলিয়া"],
        "ঠাকুরগাঁও": ["ঠাকুরগাঁও সদর","বালিয়াডাঙ্গী","হরিপুর","পীরগঞ্জ","রানীশংকৈল"]
      },

      "ময়মনসিংহ": {
        "ময়মনসিংহ": ["ময়মনসিংহ সদর","ভালুকা","ধোবাউড়া","ফুলপুর","গফরগাঁও","গৌরীপুর","হালুয়াঘাট","ঈশ্বরগঞ্জ","মুক্তাগাছা","নান্দাইল","ত্রিশাল","তারাকান্দা"],
        "জামালপুর": ["জামালপুর সদর","বকশীগঞ্জ","দেওয়ানগঞ্জ","ইসলামপুর","মাদারগঞ্জ","মেলান্দহ","সরিষাবাড়ী"],
        "নেত্রকোনা": ["নেত্রকোনা সদর","আটপাড়া","বারহাট্টা","দুর্গাপুর","কলমাকান্দা","কেন্দুয়া","খালিয়াজুড়ি","মদন","মোহনগঞ্জ","পূর্বধলা"],
        "শেরপুর": ["শেরপুর সদর","ঝিনাইগাতী","নকলা","নালিতাবাড়ী","শ্রীবরদী"]
      }

    };


  const locationType = watch("locationType");
  const selectedDivision = watch("division");
  const selectedDistrict = watch("district");
  const [preview, setPreview] = useState(null);
  const imageFile = watch("image");
  const mutation=PostFuntion(reset);

    useEffect(() => {
      if ((!imageFile || imageFile.length === 0 || errors?.image?.message) ) {   
        setPreview(null);
        return;
      }

        if (typeof imageFile === "string") {
          setPreview(imageFile);
          return;
        }

      const objectUrl = URL.createObjectURL(imageFile[0]);
      setPreview(objectUrl);

      return () => URL.revokeObjectURL(objectUrl);
    }, [imageFile, errors?.image?.message]);

  // -------------------------
  // React Query Mutation
  // -------------------------

  const onSubmit = async(data) =>{
    const formData= await CreateFormData(data);
     mutation.mutate({data:formData,
               query:{
                id:data?._id || null,
                url:"/admin/news",
                breaking:'all',
                search: '',
                status:'all',
                locationType:'all',
                subcategory:'all',
                category:'all'
                }
             });
  }

  

  // -------------------------
  // ছবি প্রিভিউ
  // -------------------------

  return (
    <form
      onSubmit={handleSubmit(onSubmit)}
      className="space-y-4 bg-white p-6 rounded shadow"
    >
      <h2 className="text-xl font-bold">সংবাদ ফর্ম</h2>

      {/* প্রতিবেদক */}
      <input
        {...register("reporter", { required: "প্রতিবেদকের নাম দিন" })}
        placeholder="প্রতিবেদকের নাম"
        className="w-full border p-2 rounded"
      />
      {errors.reporter && (
        <p className="text-red-500 text-sm">{errors.reporter.message}</p>
      )}

      {/* শিরোনাম */}
      <input
        {...register("title", { required: "শিরোনাম দিন" })}
        placeholder="সংবাদের শিরোনাম"
        className="w-full border p-2 rounded"
      />
      {errors.title && (
        <p className="text-red-500 text-sm">{errors.title.message}</p>
      )}

      {/* বিবরণ */}
      <textarea
        {...register("description", { required: "বিবরণ দিন" })}
        placeholder="সংবাদের বিস্তারিত বিবরণ"
        className="w-full border p-2 rounded h-32"
      />

      {/* বিভাগ */}
      <select {...register("category")} className="w-full border p-2 rounded">
        <option value="">বিভাগ নির্বাচন করুন</option>
        {Object.keys(categories).map((cat) => (
          <option key={cat} value={cat}>
            {cat}
          </option>
        ))}
      </select>

      {/* উপবিভাগ */}
      {(watch("category") && categories[watch("category")].length>0 ) && (
        <select {...register("subcategory")} className="w-full border p-2 rounded">
          <option value="">উপবিভাগ নির্বাচন করুন</option>
          {categories[watch("category")]?.map((sub) => (
            <option key={sub} value={sub}>
              {sub}
            </option>
          ))}
        </select>
      )}

      {/* বিশ্ব / বাংলাদেশ */}
      <select {...register("locationType")} className="w-full border p-2 rounded">
        <option value="bangladesh">বাংলাদেশ</option>
        <option value="world">বিশ্ব</option>
      </select>

      {/* বিশ্ব অপশন */}
      {locationType === "world" && (
        <select {...register("country")} className="w-full border p-2 rounded">
          <option value="">দেশ নির্বাচন করুন</option>
          {WorldList.map((country) => (
            <option key={country} value={country}>
              {country}
            </option>
          ))}
        </select>
      )}

      {/* বাংলাদেশ অপশন */}
      {locationType === "bangladesh" && (
        <>
          <select {...register("division")} className="w-full border p-2 rounded">
            <option value="">বিভাগ নির্বাচন করুন</option>
            {Object.keys(DivisionList).map((div) => (
              <option key={div} value={div}>
                {div}
              </option>
            ))}
          </select>

          {selectedDivision && (
            <select {...register("district")} className="w-full border p-2 rounded">
              <option value="">জেলা নির্বাচন করুন</option>
              {Object.keys(DivisionList[selectedDivision])?.map((dist) => (
                <option key={dist} value={dist}>
                  {dist}
                </option>
              ))}
            </select>
          )}

          {selectedDistrict && (
            <select {...register("upazila")} className="w-full border p-2 rounded">
              <option value="">উপজেলা নির্বাচন করুন</option>
              {DivisionList[selectedDivision][selectedDistrict]?.map((upa) => (
                <option key={upa} value={upa}>
                  {upa}
                </option>
              ))}
            </select>
          )}
        </>
      )}

      {/* ছবি */}
      <input type="file" accept="image/*"
         {...register("image")} 
       />

      {preview && (
        <Image
          src={preview}
          alt="preview"
          width={300}
          height={400}
          className="w-40 h-28 object-cover rounded"
        />
      )}

      {/* ছবির কৃতিত্ব */}
      <input
        {...register("imageBy")}
        placeholder="ছবির কৃতিত্ব (ফটো: )"
        className="w-full border p-2 rounded"
      />

      {/* স্ট্যাটাস */}
      <select {...register("status")} className="w-full border p-2 rounded">
        <option value="draft">ড্রাফট</option>
        <option value="published">প্রকাশিত</option>
      </select>

      {/* ব্রেকিং */}
      <label className="flex items-center space-x-2">
        <input type="checkbox" {...register("breaking")} />
        <span>ব্রেকিং সংবাদ</span>
      </label>

      <button
        type="submit"
        disabled={mutation.isPending}
        className=" cursor-pointer bg-black text-white px-4 py-2 rounded"
      >
        {defaultValues ?(mutation.isPending ? "লোড হচ্ছে..." : "সংবাদ আপডেট করুন") : (mutation.isPending ? "লোড হচ্ছে..." : "সংবাদ যোগ করুন")}
      </button>
    </form>
  );
}